app/Http/Controllers/NHYAccountController.php

insert into `NHY_Accounts` (`name`, `favorite`, `value`, `updated_at`, `created_at`) values ('UBS', '0', '0', '2019-06-17 09:50:45', '2019-06-17 09:50:45')
---
    public function newaccount(Request $request)
    {
        $newaccount = new NHYAccount();
        $newaccount->name = $request->input('name');
        $newaccount->favorite = $request->input('favorite');
        $newaccount->value = $request->input('value');
        try {
            $newaccount->save();

update `NHY_Accounts` set `favorite` = '1', `value` = '99', `NHY_Accounts`.`updated_at` = '2019-06-17 09:59:06' where `id` = 3
---
    public function updateaccount(Request $request)
    {
        $account = NHYAccount::find($request->input('id'));
        $account->favorite = $request->input('favorite');
        $account->value = $request->input('value');
        try {
            $account->save();

insert into `NHY_transactions` (`amount`, `moment`, `account_id`, `updated_at`, `created_at`) values ('10', '2019-06-17 12:10', '3', '2019-06-17 10:50:29', '2019-06-17 10:50:29')
---
    public function newtransaction(Request $request)
    {
        $newtrans = new NHYTransaction();
        $newtrans->amount = $request->input('amount');
        $newtrans->moment = $request->input('moment');
        $newtrans->account_id = $request->input('accountid');
        try {
            $newtrans->save();